Revit 2027 API
InstanceVoidCutUtils.InstanceVoidCutExists Method
 Check whether the instance is cutting the element
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool InstanceVoidCutExists(
	Element element,
	Element cuttingInstance
)
Public Shared Function InstanceVoidCutExists (
	element As Element,
	cuttingInstance As Element
) As Boolean
public:
static bool InstanceVoidCutExists(
	Element^ element,
	Element^ cuttingInstance
)
static member InstanceVoidCutExists :
        element : Element *
        cuttingInstance : Element -> bool
Parameters
element Element
 The element being cut
cuttingInstance Element
 The cutting family instance
Return Value
Boolean
 Returns true if the instance is cutting the element.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
InstanceVoidCutUtils Class
Autodesk.Revit.DB Namespace